-- setup
-- end of setup

-- thread reader1
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "kseq"<=500000;
+---------------------+
| EXPR$0              |
+---------------------+
| 500000              |
+---------------------+

> select count(*) from bench1m where "kseq"<=500000;
+---------------------+
| EXPR$0              |
+---------------------+
| 500000              |
+---------------------+

> select count(*) from bench1m where "kseq"<=500000;
+---------------------+
| EXPR$0              |
+---------------------+
| 500000              |
+---------------------+

> select count(*) from bench1m where "kseq"<=500000;
+---------------------+
| EXPR$0              |
+---------------------+
| 500000              |
+---------------------+

> select count(*) from bench1m where "kseq"<=500000;
+---------------------+
| EXPR$0              |
+---------------------+
| 500000              |
+---------------------+

-- end of thread reader1

-- thread reader2
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k2" = 1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2" = 1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2" = 1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2" = 1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2" = 1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

-- end of thread reader2

-- thread reader3
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k500k">1000;
+---------------------+
| EXPR$0              |
+---------------------+
| 998013              |
+---------------------+

> select count(*) from bench1m where "k500k">1000;
+---------------------+
| EXPR$0              |
+---------------------+
| 998013              |
+---------------------+

> select count(*) from bench1m where "k500k">1000;
+---------------------+
| EXPR$0              |
+---------------------+
| 998013              |
+---------------------+

> select count(*) from bench1m where "k500k">1000;
+---------------------+
| EXPR$0              |
+---------------------+
| 998013              |
+---------------------+

> select count(*) from bench1m where "k500k">1000;
+---------------------+
| EXPR$0              |
+---------------------+
| 998013              |
+---------------------+

-- end of thread reader3

