-- setup
-- end of setup

-- thread reader1
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

-- end of thread reader1

-- thread reader2
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

-- end of thread reader2

-- thread reader3
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

-- end of thread reader3

