-- setup
-- end of setup

-- thread reader11
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

-- end of thread reader11

-- thread reader12
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

-- end of thread reader12

-- thread reader13
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

-- end of thread reader13

-- thread reader21
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

-- end of thread reader21

-- thread reader22
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

-- end of thread reader22

-- thread reader23
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

> select count(*) from bench1m where "k100"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 10098               |
+---------------------+

-- end of thread reader23

-- thread reader31
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

-- end of thread reader31

-- thread reader32
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

-- end of thread reader32

-- thread reader33
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

> select count(*) from bench1m where "k500k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 2                   |
+---------------------+

-- end of thread reader33

