-- setup
-- end of setup

-- thread comp
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k4"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 249504              |
+---------------------+

> select count(*) from bench1m where "k100"<50;
+---------------------+
| EXPR$0              |
+---------------------+
| 489941              |
+---------------------+

> select count(*) from bench1m where "k250k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 3                   |
+---------------------+

> select count(*) from bench1m where "k500k" between 250000 and 750000;
+---------------------+
| EXPR$0              |
+---------------------+
| 499443              |
+---------------------+

-- end of thread comp

-- thread reader1
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

> select count(*) from bench1m where "k2"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 499598              |
+---------------------+

-- end of thread reader1

-- thread reader2
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k4"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 249504              |
+---------------------+

> select count(*) from bench1m where "k4"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 249504              |
+---------------------+

> select count(*) from bench1m where "k4"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 249504              |
+---------------------+

> select count(*) from bench1m where "k4"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 249504              |
+---------------------+

> select count(*) from bench1m where "k4"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 249504              |
+---------------------+

-- end of thread reader2

-- thread reader3
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k100"<50;
+---------------------+
| EXPR$0              |
+---------------------+
| 489941              |
+---------------------+

> select count(*) from bench1m where "k100"<50;
+---------------------+
| EXPR$0              |
+---------------------+
| 489941              |
+---------------------+

> select count(*) from bench1m where "k100"<50;
+---------------------+
| EXPR$0              |
+---------------------+
| 489941              |
+---------------------+

> select count(*) from bench1m where "k100"<50;
+---------------------+
| EXPR$0              |
+---------------------+
| 489941              |
+---------------------+

> select count(*) from bench1m where "k100"<50;
+---------------------+
| EXPR$0              |
+---------------------+
| 489941              |
+---------------------+

-- end of thread reader3

-- thread reader4
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k250k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 3                   |
+---------------------+

> select count(*) from bench1m where "k250k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 3                   |
+---------------------+

> select count(*) from bench1m where "k250k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 3                   |
+---------------------+

> select count(*) from bench1m where "k250k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 3                   |
+---------------------+

> select count(*) from bench1m where "k250k"=1;
+---------------------+
| EXPR$0              |
+---------------------+
| 3                   |
+---------------------+

-- end of thread reader4

-- thread reader5
> set schema 's';
0 rows affected.
> select count(*) from bench1m where "k500k" between 250000 and 750000;
+---------------------+
| EXPR$0              |
+---------------------+
| 499443              |
+---------------------+

> select count(*) from bench1m where "k500k" between 250000 and 750000;
+---------------------+
| EXPR$0              |
+---------------------+
| 499443              |
+---------------------+

> select count(*) from bench1m where "k500k" between 250000 and 750000;
+---------------------+
| EXPR$0              |
+---------------------+
| 499443              |
+---------------------+

> select count(*) from bench1m where "k500k" between 250000 and 750000;
+---------------------+
| EXPR$0              |
+---------------------+
| 499443              |
+---------------------+

> select count(*) from bench1m where "k500k" between 250000 and 750000;
+---------------------+
| EXPR$0              |
+---------------------+
| 499443              |
+---------------------+

-- end of thread reader5

